// 自动生成的图标定义文件
// @ts-ignore
import type { IconDefinition } from '../types'

const Aboutfill: IconDefinition = {
  "tag": "svg",
  "attrs": {
    "viewBox": "0 0 1024 1024"
  },
  "children": [
    {
      "tag": "path",
      "attrs": {
        "d": "M512 65.983C266.048 65.983 65.983 266.048 65.983 512S266.048 958.017 512 958.017 958.017 757.952 958.017 512 757.952 65.983 512 65.983z m32 670.018c0 17.696-14.303 32-32 32s-32-14.303-32-32V448c0-17.696 14.303-32 32-32 17.696 0 32 14.303 32 32v288z m-32-384c-26.496 0-48-21.537-48-48C464 277.472 485.504 256 512 256s48 21.472 48 48c0 26.464-21.504 48-48 48z"
      }
    }
  ]
}

export default Aboutfill
