// 自动生成的图标定义文件
// @ts-ignore
import type { IconDefinition } from '../types'

const Sidebar: IconDefinition = {
  "tag": "svg",
  "attrs": {
    "viewBox": "0 0 1024 1024"
  },
  "children": [
    {
      "tag": "path",
      "attrs": {
        "d": "M128 128h768a42.666667 42.666667 0 0 1 42.666667 42.666667v682.666666a42.666667 42.666667 0 0 1-42.666667 42.666667H128a42.666667 42.666667 0 0 1-42.666667-42.666667V170.666667a42.666667 42.666667 0 0 1 42.666667-42.666667z m213.333333 85.333333H170.666667v597.333334h170.666666V213.333333z m85.333334 0v597.333334h426.666666V213.333333H426.666667z"
      }
    }
  ]
}

export default Sidebar
